Revit 2027 API
View.SetSketchyLines Method
 Sets the sketchy lines settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSketchyLines(
	ViewDisplaySketchyLines sketchyLines
)
Public Sub SetSketchyLines (
	sketchyLines As ViewDisplaySketchyLines
)
public:
void SetSketchyLines(
	ViewDisplaySketchyLines^ sketchyLines
)
member SetSketchyLines :
        sketchyLines : ViewDisplaySketchyLines -> unit
Parameters
sketchyLines ViewDisplaySketchyLines
 Sketchy Lines settings to set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This view does not contain display-related properties.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace